app/controllers/locations_controller.rb

  def index
    @locations = Location.all
---
SELECT `locations`.* FROM `locations`

  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
---
INSERT INTO `locations` (`address`, `created_at`, `lat`, `lng`, `updated_at`, `zip_code`) VALUES ('100 Spear St, San Francisco, CA', '2013-08-25 14:35:52', 37.792528, -122.393981, '2013-08-25 14:35:52', '94105')

  def update
    @location = Location.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(params[:location])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", "7"]]
UPDATE "locations" SET "address" = '525 Market St, San Francisco, CA', "updated_at" = '2013-08-24 11:26:35.477669' WHERE "locations"."id" = 7