app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'htluan2605@gmail.com' LIMIT 1
---
  def create
    # lay thong tin user duoc submit
    user = User.find_by_email(params[:session][:email].downcase)