app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    # equivalent to :
    # @user = User.new(name: "Foo Bar", email: "foo@invalid",
    #password: "foo", password_confirmation: "bar")
    if @user.save #validated
---
INSERT INTO `users` (`created_at`, `email`, `name`, `password_digest`, `remember_token`, `updated_at`) VALUES ('2013-06-20 03:03:37', 'test@gmail.com', 'Test', '$2a$10$zlboWhQC57WIJgKRkxqQq.NJPsNPIDw4bFlYD1l3OFf9vs/C2oYte', 'oOkQ4Gx4JfHzacDWkWPAkQ', '2013-06-20 03:03:37')

  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
UPDATE `users` SET `password_digest` = '$2a$10$KKGaKK4h8H5OHLIK6MZ3XOicRYpf5OEOQonqjinpiSvE5M6IIAB/a', `remember_token` = 'lAtQ5mtTUgSpMnS-gCLGEA', `updated_at` = '2013-06-21 07:29:25' WHERE `users`.`id` = 11